gunjouinc/Aoiduino/aoiduino/esp-esp8266.cpp
/******************************************************************************
**
** Copyright 2009-2023 Gunjou Inc. All rights reserved.
** Contact: Gunjou Inc. (information@gunjou.co.jp)
**
** This software is released under the MIT License.
** https://github.com/gunjouinc/Aoiduino/blob/master/LICENSE
**
******************************************************************************/
#ifdef ESP8266
/** Esp WiFi timeout */
#define ESP_WIFI_TIMEOUT 30000

#include "esp-esp8266.h"
/* Flash */
#include <FS.h>
FS *EspStorage = &SPIFFS;
/* RTC */
#include <time.h>
/* Ticker */
#include <Ticker.h>
Ticker ticker;
Ticker watchdog;
uint32_t watchdogSecond = 0;
uint32_t watchdogMills = 0;
/* WiFi */
#include <ESP8266WiFi.h>
#include <WiFiClient.h>
#include <WiFiClientSecure.h>
WiFiClient wifiClient;
WiFiClientSecure wifiClientSecure;

/** File mode - append */
#define _FILE_APPEND_ "a"
/** File mode - read */
#define _FILE_READ_ "r"
/** File mode - write */
#define _FILE_WRITE_ "w"
/** Flash root path */
#define _FLASH_ "/mnt/spif"

/**
 * @namespace AoiEsp
 * @brief Aoi esp classes.
 */
namespace AoiEsp
{
// Static variables.
    AoiBase::FunctionTable *Esp8266::m_functionTable = 0;
    /**
     * @fn Esp8266::Esp8266( void )
     *
     * Constructor. Member variables are initialized.
     */
    Esp8266::Esp8266( void )
    {
        if( m_functionTable )
            return;
    // Sets function table, If there is no instance.
        AoiBase::FunctionTable ftl[] =
        {
        // ^ Please set your function to use.
            /* Arduino Core */
            { "analogRead", &Arduino::analogRead },
            { "analogWrite", &Arduino::analogWrite },
            { "delay", &Arduino::delay },
            { "delayMicroseconds", &Arduino::delayMicroseconds },
            { "digitalRead", &Arduino::digitalRead },
            { "digitalWrite", &Arduino::digitalWrite },
            { "micros", &Arduino::micros },
            { "millis", &Arduino::millis },
            { "noTone", &Arduino::noTone },
            { "pinMode", &Arduino::pinMode },
            { "tone", &Arduino::tone },
            { "yield", &Arduino::yield },
            /* Alexa */
            { "alexaAddDevice", &AoiUtil::Alexa::alexaAddDevice },
            { "alexaBegin", &AoiUtil::Alexa::alexaBegin },
            { "alexaGetRGB", &AoiUtil::Alexa::alexaGetRGB },
            { "alexaGetValue", &AoiUtil::Alexa::alexaGetValue },
            { "alexaLoop", &AoiUtil::Alexa::alexaLoop },
            /* File */
            { ">", &Esp8266::create },
            { ">>", &Esp8266::append },
            { "cat", &Esp8266::read },
            { "cd", &Esp8266::cd },
            { "format", &Esp8266::format },
            { "ll", &Esp8266::ll },
            { "mkdir", &Esp8266::mkdir },
            { "pwd", &Esp8266::pwd },
            { "rm", &Esp8266::remove },
            { "rmdir", &Esp8266::rmdir },
            { "touch", &Esp8266::touch },
            /* LowPower */
            { "deepSleep", &Esp8266::deepSleep },
            { "dmesg", &Esp8266::dmesg },
            { "reboot", &Esp8266::restart },
            /* HTTP */
            { "httpBegin", &Esp8266::httpBegin },
            { "httpGet", &AoiUtil::Http::httpGet },
            { "httpGetRaw", &Esp8266::httpGetRaw },
            { "httpPost", &Esp8266::httpPost },
            /* IR */
            { "irReceiveBegin", &AoiUtil::IRRemote::irReceiveBegin },
            { "irReceiveRaw", &AoiUtil::IRRemote::irReceiveRaw },
            { "irSendBegin", &AoiUtil::IRRemote::irSendBegin },
            { "irSendRaw", &AoiUtil::IRRemote::irSendRaw },
            /* NeoPixel */
            { "neoPixelBegin", &AoiUtil::NeoPixel::neoPixelBegin },
            { "neoPixelClear", &AoiUtil::NeoPixel::neoPixelClear },
            { "neoPixelEnd", &AoiUtil::NeoPixel::neoPixelEnd },
            { "neoPixelFill", &AoiUtil::NeoPixel::neoPixelFill },
            { "neoPixelSetBrightness", &AoiUtil::NeoPixel::neoPixelSetBrightness },
            { "neoPixelSetPixelColor", &AoiUtil::NeoPixel::neoPixelSetPixelColor },
            { "neoPixelShow", &AoiUtil::NeoPixel::neoPixelShow },
            /* RTC */
            { "date", &Esp8266::date },
            /* Servo */
            { "servoAttach", &AoiUtil::Servo_::servoAttach },
            { "servoBegin", &AoiUtil::Servo_::servoBegin },
            { "servoEnd", &AoiUtil::Servo_::servoEnd },
            { "servoWriteMicroseconds", &AoiUtil::Servo_::servoWriteMicroseconds },
            /* Watchdog */
            { "watchdogBegin", &Esp8266::watchdogBegin },
            { "watchdogEnd", &Esp8266::watchdogEnd },
            { "watchdogKick", &Esp8266::watchdogKick },
            { "watchdogTimeleft", &Esp8266::watchdogTimeleft },
            /* WiFi */
            { "ifconfig", &Esp8266::ifConfig },
            { "iwlist", &Esp8266::wifiScanNetworks },
            { "wifiBegin", &Esp8266::wifiBegin },
            { "wifiEnd", &Esp8266::wifiEnd },
            { "wifiRtc", &Esp8266::wifiRtc },
        // $ Please set your function to use.
            { "", 0 }
        };
    // Creates function table to avoid kernel panic.
        uint8_t c = sizeof(ftl) / sizeof(AoiBase::FunctionTable);
        m_functionTable = Arduino::functionTable( ftl, c );
    // Initalize library
        /* File */
        SPIFFS.begin();
        /* HTTP */
        http = &wifiClient;
    }
    /**
     * @fn Esp8266::~Esp8266( void )
     *
     * Destructor. Member variables are deleted.
     */
    Esp8266::~Esp8266( void )
    {
    }
    /**
     * @fn String Esp8266::className( void )
     *
     * @see bool AbstractBase::className( void )
     */
    String Esp8266::className( void )
    {
        return String( "Esp8266" );
    }
    /**
     * @fn bool Esp8266::isExist( const String &function )
     *
     * @see bool AbstractBase::isExist( const String &function )
     */
    bool Esp8266::isExist( const String &function )
    {
        return Arduino::isExist( function, m_functionTable );
    }
    /**
     * @fn String Esp8266::practice( StringList *args )
     *
     * @see String AbstractBase::practice( StringList *args )
     */
    String Esp8266::practice( StringList *args )
    {
        return Arduino::practice( args, m_functionTable );
    }
    /**
     * @fn String Esp8266::usages( void )
     *
     * @see String AbstractBase::usages( void )
     */
    String Esp8266::usages( void )
    {
        return Arduino::usages( m_functionTable );
    }
    /**
     * @fn StringList* Esp8266::rcScript( const String &index )
     *
     * @see StringList* AbstractBase::rcScript( const String &index )
     */
    StringList* Esp8266::rcScript( const String &index )
    {
        StringList *sl = 0;
        String s = appendRootPath( index );

        if( !EspStorage->exists(s) )
            return sl;

        File f = EspStorage->open( s, _FILE_READ_ );
        if( f )
        {
            String s = f.readString();
            f.close();
            sl = split( s, String(_lf) );
        }

