gunjouinc/Aoiduino/aoiduino/esp-esp8266.cpp
        return sl;
    }
    /**
     * @fn String Esp8266::append( StringList *args )
     *
     * Append value on current device.
     *
     * @param[in] args Reference to arguments.
     * @return value string.
     */
    String Esp8266::append( StringList *args )
    {
        String s, t;
        int c = count( args );

        if( c<2 )
            s = usage( ">> file .+" );
        else
        {
            t = appendRootPath( _a(0) );
        // Create file if need
            if( !EspStorage->exists(t) )
            {
                File w = EspStorage->open( t, _FILE_WRITE_ );
                w.close();
            }
            File f = EspStorage->open( t, _FILE_APPEND_ );
            if( 0<f.size() )
                f.print( _lf );
            for( int i=1; i<c; i++ )
            {
                if( 1<i )
                    f.print( STR_SPACE );
                f.print( _a(i) );
            }
            f.close();
        // Re-open, Can't practice f.seek( 0 )
            f = EspStorage->open( t, _FILE_READ_ );
            s = prettyPrintTo( "value", f.readString() );
            f.close();
         }

         return s;
    }
    /**
     * @fn String Esp8266::cd( StringList *args )
     *
     * Change device.
     *
     * @param[in] args Reference to arguments.
     * @return Empty string.
     */
    String Esp8266::cd( StringList *args )
    {
        String s;
        String path;

        switch( count(args) )
        {
            case 1:
                path = _a( 0 );
                if( (path==_FLASH_) || (path=="/") )
                    EspStorage = &SPIFFS;
                else
                    s = cd( 0 );
                break;
            default:
                s = usage( "cd ("+String(_FLASH_)+")" );
                break;
        }

        return s;
    }
    /**
     * @fn String Esp8266::create( StringList *args )
     *
     * Create value on current device.
     *
     * @param[in] args Reference to arguments.
     * @return value string.
     */
    String Esp8266::create( StringList *args )
    {
        String s, t;
        int c = count( args );

        if( c<2 )
            s = usage( "> file .+" );
        else
        {
            t = appendRootPath( _a(0) );
            if( EspStorage->exists(t) )
                EspStorage->remove( t );
            s = append( args );
        }

        return s;
    }
    /**
     * @fn String Esp8266::format( StringList *args )
     *
     * Format file device.
     *
     * @param[in] args Reference to arguments.
     * @return Empty string.
     */
    String Esp8266::format( StringList *args )
    {
        String s;
        String path;

        switch( count(args) )
        {
            case 1:
                path = _a( 0 );
                if( path==_FLASH_ )
                    SPIFFS.format();
                else
                    s = format( 0 );
                break;
            default:
                s = usage( "format ("+String(_FLASH_)+")" );
                break;
        }

        return s;
    }
    /**
     * @fn String Esp8266::ll( StringList *args )
     *
     * Return file detail list in current device.
     *
     * @param[in] args Reference to arguments.
     * @return Current device.
     */
    String Esp8266::ll( StringList *args )
    {
        String s, p, root;
        DynamicJsonBuffer json;
        JsonArray &r = json.createArray();
        Dir d;
        File f;

        switch( count(args) )
        {
            case 1:
                root = _a( 0 );
            case 0:
            // Root path
                root = appendRootPath( root );
                d = EspStorage->openDir( root );
                p = root;
            // File info to JSON
                while( d.next() )
                {
                    File f = d.openFile( "r" );
                    JsonObject &o = r.createNestedObject();
                    o[ "type" ] = f.isDirectory() ? "d" : "-";
                    o[ "name" ] = String(f.name()).substring( p.length() );
                    o[ "size" ] = f.size();
                    f.close();
                }
                s = "";
                r.prettyPrintTo( s );
                break;
            default:
                s = usage( "ll (path)?" );
                break;
        }

        return s;
    }
    /**
     * @fn String Esp8266::mkdir( StringList *args )
     *
     * Make directory on current device.
     *
     * @param[in] args Reference to arguments.
     * @return Empty string.
     */
    String Esp8266::mkdir( StringList *args )
    {
        String s, t;

        switch( count(args) )
        {
            case 1:
                t = appendRootPath( _a(0) );
                if( EspStorage->exists(t) )
                    s = mkdir( 0 );
                else
                    EspStorage->mkdir( t );
                break;
            default:
                s = usage( "mkdir path" );
                break;
        }

        return s;
    }
    /**
     * @fn String Esp8266::pwd( StringList *args )
     *
     * Return current device.
     *
     * @param[in] args Reference to arguments.
     * @return Current device.
     */
    String Esp8266::pwd( StringList *args )
    {
        String s;

        switch( count(args) )
        {
            case 0:
                s = prettyPrintTo( "value" , _FLASH_ );
                break;
            default:
                s = usage( "pwd" );
                break;
        }

        return s;
    }
    /**
     * @fn String Esp8266::read( StringList *args )
     *
     * Return file content on current device.
     *
     * @param[in] args Reference to arguments.
     * @return File content.
     */
    String Esp8266::read( StringList *args )
    {
        String s, t;
        File f;

        switch( count(args) )
        {
            case 1:
                t = appendRootPath( _a(0) );
                if( !EspStorage->exists(t) )
                    s = read( 0 );
                else
                {
                    f = EspStorage->open( t, _FILE_READ_ );
                    if( f )
                    {
                        s = prettyPrintTo( "value" , f.readString() );
                        f.close();
                    }
                }
                break;
            default:
                s = usage( "cat file" );
                break;
        }

        return s;
    }
    /**
     * @fn String Esp8266::remove( StringList *args )
     *
     * Remove file on current device.
     *
     * @param[in] args Reference to arguments.
     * @return Empty string.
     */
    String Esp8266::remove( StringList *args )
    {
        String s, t;

        switch( count(args) )
        {
            case 1:
                t = appendRootPath( _a(0) );
                if( !EspStorage->exists(t) )
                    s = remove( 0 );
                else
                    EspStorage->remove( t );
                break;
            default:
                s = usage( "rm file" );
                break;
        }

        return s;
    }
    /**
     * @fn String Esp8266::rmdir( StringList *args )
     *
     * Remove directory on current device.
     *
     * @param[in] args Reference to arguments.
     * @return Empty string.
     */
    String Esp8266::rmdir( StringList *args )
    {
        String s, t;

        switch( count(args) )
        {
            case 1:
                t = appendRootPath( _a(0) );
                if( !EspStorage->exists(t) )
                    s = rmdir( 0 );
                else
                    EspStorage->rmdir( t );
                break;
            default:
                s = usage( "rmdir path" );
                break;
        }

        return s;
    }
    /**
     * @fn String Esp8266::httpBegin( StringList *args )
     *
     * Initalize https certs.
     *
     * @param[in] args Reference to arguments.
     * @return Empty string.
     */
    String Esp8266::httpBegin( StringList *args )
    {
        String s, t;
        File rc, cc, pk;

        switch( count(args) )
        {
            case 0:
                http = &wifiClient;
                break;
/*
 * Feature removed due to underlying issue.
 *
            case 3:
                http = &wifiClientSecure;
            // RootCA
                rc = EspStorage->open( appendRootPath(_a(0)), _FILE_READ_ );
                t = rc.readString();
                wifiClientSecure.setCACert( (uint8_t*)t.c_str(), t.length() );
                rc.close();
            // Client certificate
                cc = EspStorage->open( appendRootPath(_a(1)), _FILE_READ_ );
                t = cc.readString();
                wifiClientSecure.setCertificate( (uint8_t*)t.c_str(), t.length() );
                cc.close();
            // Client private key
                pk = EspStorage->open( appendRootPath(_a(2)), _FILE_READ_ );
                t = pk.readString();
                wifiClientSecure.setPrivateKey( (uint8_t*)t.c_str(), t.length() );
                pk.close();
                break;
            default:
                s = usage( "httpBegin CACert Certificate PrivateKey" );
*/
            default:
                s = usage( "httpBegin" );
                break;
        }

        return s;
    }
    /**
     * @fn String Esp8266::httpGetRaw( StringList *args )
     *
     * Send HTTP GET to server and save raw data.
     *
     * @param[in] args Reference to arguments.
     * @return Recieved size.
     */
    String Esp8266::httpGetRaw( StringList *args )
    {
        String s;
        String t;
        String host;
        int port = 80;
        int timeout = 30 * 1000;
        // response
        File f;
        int start = ::millis();
        int size = 0;
        int i = 0;
        int j = 0;

        char *buf = new char[ _AOIUTIL_HTTP_BUFFER_SIZE_+1 ];
        switch( count(args) )
        {
            case 5:
                timeout = _atoi( 4 ) * 1000;
            case 4:
                port = _atoi( 3 );
            case 3:
                host = _a( 0 );
                if( !http->connect(host.c_str(),port) )
                    return httpGetRaw( 0 );
            // GET
                http->println( "GET "+_a(1)+" HTTP/1.0" );
                http->println( "Host: " + host );
                http->println( "User-Agent: " + String(STR_USER_AGENT) );
                http->println( "Connection: close" );
                http->println();
            // Response
                t = appendRootPath( _a(2) ); 
                if( EspStorage->exists(t) )
                    EspStorage->remove( t );
                f = EspStorage->open( t, _FILE_WRITE_ );
                while( true )
                {
                    if( i=http->available() )
                    {
                        i = http->read( (uint8_t*)buf, _AOIUTIL_HTTP_BUFFER_SIZE_ );
                        j = 0;
                        if( !size )
                            j = responseRaw( buf, i );
                        f.write( (uint8_t*)(buf+j), i-j );
                        size += (i-j);
                    }
                    if( !http->available() && !http->connected() )
                    {
                        http->stop();
                        break;
                    }
                // timeout
                    if( timeout<(::millis()-start) )
                        break;
                }
                f.close();
                s = prettyPrintTo( "value", size );
                break;
            default:
                s = usage( "httpGetRaw host path file (port timeout)?" );
                break;
        }
        delete [] buf;

        return s;
    }
    /**
     * @fn String Esp8266::httpPost( StringList *args )
     *
     * Send HTTP POST to server.
     *
     * @param[in] args Reference to arguments.
     * @return Recieved content.
     */
    String Esp8266::httpPost( StringList *args )
    {
        String s, t, header, footer;
        File f;
        int size = 0;
        String host;
        int port = 80;
        int timeout = 30 * 1000;
        uint8_t *buf = 0;

        switch( count(args) )
        {
            case 5:
                timeout = _atoi( 4 ) * 1000;
            case 4:
                port = _atoi( 3 );
            case 3:
                t = appendRootPath( _a(2) );
                if( !EspStorage->exists(t) )
                    return AoiUtil::Http::httpPost( args );
            // Request body
                header = requestBodyHeaderInPut( STR_BOUNDARY, STR_AOIDUINO, t,
                                                 &size );
                footer = requestBodyFooterInPut( STR_BOUNDARY );
                size += header.length() + footer.length();
            // POST
                host = _a( 0 );
                if( !http->connect(host.c_str(),port) )
                    return httpPost( 0 );
                http->println( "POST "+_a(1)+" HTTP/1.0" );
                http->println( "Host: " + host );
                http->println( "User-Agent: " + String(STR_USER_AGENT) );
                http->print( "Content-Type: multipart/form-data; " );
                http->println( "boundary=\""+String(STR_BOUNDARY)+"\"" );
                http->println( "Content-Length: "+String(size) );
                http->println( "Connection: close" );
                http->println();
                http->print( header );
              // Upload file
                f = EspStorage->open( t, _FILE_READ_ );
                buf = new uint8_t[ _AOIUTIL_HTTP_BUFFER_SIZE_ ];
                while( f.available() )
                {
                    size = f.read( buf, _AOIUTIL_HTTP_BUFFER_SIZE_ );
                    http->write( buf, size );
                }
                delete [] buf;
                f.close();
                http->print( footer );
            // Response
                s = response( timeout );
                s = prettyPrintTo( "value", s );
                break;
            default:
                s = usage( "httpPost host path (file|text) (port timeout)?" );
                break;
        }

        return s;
    }
    /**
     * @fn String Esp8266::touch( StringList *args )
     *
     * Create empty file on current device.
     *
     * @param[in] args Reference to arguments.
     * @return Empty string.
     */
    String Esp8266::touch( StringList *args )
    {
        String s, t;
        File f;

        switch( count(args) )
        {
            case 1:
                t = appendRootPath( _a(0) );
                f = EspStorage->open( t, _FILE_WRITE_ );
                if( f )
                    f.close();
                break;
            default:
                s = usage( "touch file" );
                break;
        }

        return s;
    }
    /**
     * @fn String Esp8266::deepSleep( StringList *args )
     *
     * Enter the deep sleep state.
     *
     * @param[in] args Reference to arguments.
     * @return Empty string.
     */
    String Esp8266::deepSleep( StringList *args )
    {
        String s;
        RFMode mode;

        switch( count(args) )
        {
            case 0:
                ESP.deepSleep( 0 );
                break;
            case 1:
            // Micro second.
                mode = WAKE_RF_DEFAULT;
                ESP.deepSleep( _atoi(0) * 1000 * 1000, mode );
                break;
            default:
                s = usage( "deepSleep [0-9]*" );
                break;
        }

        return s;
    }
    /**
     * @fn String Esp8266::dmesg( StringList *args )
     *
     * Returns system information.
     *
     * @param[in] args Reference to arguments.
     * @return System information.
     */
    String Esp8266::dmesg( StringList *args )
    {
        String s;
        DynamicJsonBuffer json;
        JsonObject &r = json.createObject();

        switch( count(args) )
        {
            case 0:
                r[ "chipId" ] = String( ESP.getChipId(), HEX );
                r[ "coreVersion" ] = ESP.getCoreVersion();
                r[ "cpuFreqMHz" ] = ESP.getCpuFreqMHz();
                r[ "flashChipId" ] = String( ESP.getFlashChipId(), HEX );
                r[ "flashChipSize" ] = ESP.getFlashChipSize();
                r[ "freeHeap" ] = ESP.getFreeHeap();
                r[ "freeSketchSpace" ] = ESP.getFreeSketchSpace();
                r[ "resetReason" ] = ESP.getResetReason();
                r[ "sdkVersion" ] = ESP.getSdkVersion();
                r[ "sketchSize" ] = ESP.getSketchSize();
                r.prettyPrintTo( s );
                break;
            default:
                s = usage( "dmesg" );
                break;
        }

        return s;
    }
    /**
     * @fn String Esp8266::restart( StringList *args )
     *
     * Reboot the system.
     *
     * @param[in] args Reference to arguments.
     * @return Empty string.
     */
    String Esp8266::restart( StringList *args )
    {
        String s;

        switch( count(args) )
        {
            case 0:
                ESP.restart();
                break;
            case 1:
                ticker.once_ms( _atoi(0), reboot );
                break;
            default:
                s = usage( "reboot ([0-9]+)" );
                break;
        }

        return s;
    }
    /**
     * @fn String Esp8266::date( StringList *args )
     *
     * Print date.
     *
     * @param[in] args Reference to arguments.
     * @return date string.
     */
    String Esp8266::date( StringList *args )
    {
        String s;
        uint8_t size = 20;
        char *buf = NULL;
        time_t t;
        struct tm *rtc;
        struct timeval tv;

        switch( count(args) )
        {
            case 0:
                t = time( NULL );
                rtc = localtime( &t );
                buf = new char[ size ];
                snprintf( buf, size,
                          "%04d-%02d-%02dT%02d:%02d:%02d",
                          rtc->tm_year+1900, rtc->tm_mon+1, rtc->tm_mday,
                          rtc->tm_hour, rtc->tm_min, rtc->tm_sec );
                s = prettyPrintTo( "value", buf );
                delete [] buf;
                break;
            case 1:
                tv.tv_sec = _atoul( 0 );
                settimeofday( &tv, NULL );
                break;
            default:
                s = usage( "date (unixtime)?" );
                break;
        }

        return s;
    }
    /**
     * @fn String Esp8266::watchdogBegin( StringList *args )
     *
     * Initialize the Watchdog and start to check timer(mesc).
     *
     * @param[in] args Reference to arguments.
     * @return Empty string.
     */
    String Esp8266::watchdogBegin( StringList *args )
    {
        String s;

        switch( count(args) )
        {
            case 1:
                watchdog.once_ms( _atoi(0), reboot );
                watchdogSecond = _atoi(0);
                watchdogMills = ::millis();
                break;
            default:
                s = usage( "watchdogBegin [0-9]+" );
                break;
        }

        return s;
    }
    /**
     * @fn String Esp8266::watchdogEnd( StringList *args )
     *
     * Stop to check timer for avoid bite watchdog.
     *
     * @param[in] args Reference to arguments.
     * @return Empty string.
     */
    String Esp8266::watchdogEnd( StringList *args )
    {
        String s;

        switch( count(args) )
        {
            case 0:
                watchdog.detach();
                watchdogSecond = 0;
                watchdogMills = 0;
                break;
            default:
                s = usage( "watchdogEnd" );
                break;
        }

        return s;
    }
    /**
     * @fn String Ast::watchdogKick( StringList *args )
     *
     * Kick to watchdog for notify keep alive.
     *
     * @param[in] args Reference to arguments.
     * @return Empty string.
     */
    String Esp8266::watchdogKick( StringList *args )
    {
        String s;

        switch( count(args) )
        {
            case 0:
                watchdog.detach();
                watchdog.once_ms( watchdogSecond, reboot );
                watchdogMills = ::millis();
                break;
            default:
                s = usage( "watchdogKick" );
                break;
        }

        return s;
    }
    /**
     * @fn String Esp8266::watchdogTimeleft( StringList *args )
     *
     * Get a remain time for bite watchdog.
     *
     * @param[in] args Reference to arguments.
     * @return Remain time to expire timeout(mesc).
     */
    String Esp8266::watchdogTimeleft( StringList *args )
    {
        String s;
        uint32_t i = 0;

        switch( count(args) )
        {
            case 0:
                i = watchdogSecond - (::millis()-watchdogMills);
                s = prettyPrintTo( "value" , i );
                break;
            default:
                s = usage( "watchdogTimeleft" );
                break;
        }

        return s;
    }
    /**
     * @fn String Esp8266::ifConfig( StringList *args )
     *
     * Show network information.
     *
     * @param[in] args Reference to arguments.
     * @return Network information.
     */
    String Esp8266::ifConfig( StringList *args )
    {
        String s;
        DynamicJsonBuffer json;
        JsonObject &r = json.createObject();

        switch( count(args) )
        {
            case 0:
                r[ "ipAddress" ] = WiFi.localIP().toString();
                r[ "subnetMask" ] = WiFi.subnetMask().toString();
                r[ "gatewayIp" ] = WiFi.gatewayIP().toString();
                r[ "macAddress" ] = WiFi.macAddress();
                r[ "dnsIP1" ] = WiFi.dnsIP( 0 ).toString();
                r[ "dnsIP2" ] = WiFi.dnsIP( 1 ).toString();
                r[ "softAP" ] = WiFi.softAPIP().toString();
                r.prettyPrintTo( s );
                break;
            default:
                s = usage( "ifconfig" );
                break;
        }

        return s;
    }
    /**
     * @fn String Esp8266::wifiScanNetworks( StringList *args )
     *
     * Scan wifi networks.
     *
     * @param[in] args Reference to arguments.
     * @return Returns SSID, RSSI and Encryption type.
     */
    String Esp8266::wifiScanNetworks( StringList *args )
    {
        String s;
        int i = 0;
        DynamicJsonBuffer json;
        JsonArray &r = json.createArray();

