gunjouinc/Aoiduino/aoiduino/esp-esp8266.cpp
        switch( count(args) )
        {
            case 0:
                i = WiFi.scanNetworks();
                if( !i )
                    s = STR_NO_NETWORKS_FOUND;
                else
                {
                    for( int j=0; j<i; j++ )
                    {
                        JsonObject &o = r.createNestedObject();
                        o[ "ssid" ] = WiFi.SSID( j );
                        o[ "rssi" ] = WiFi.RSSI( j );
                    // Sets encription type.
                        String t = "";
                        switch( WiFi.encryptionType(j) )
                        {
                            case 2:
                                t = "TKIP(WPA)";
                                break;
                            case 5:
                                t = "WEP";
                                break;
                            case 4:
                                t = "CCMP(WPA)";
                                break;
                            case 7:
                                t = "None";
                                break;
                            case 8:
                                t = "Auto";
                                break;
                            default:
                                t = "Other";
                                break;
                        }
                        o[ "type" ] = t;
                    }
                    r.prettyPrintTo( s );
                }
                break;
            default:
                s = usage( "iwlist" );
                break;
        }

        return s;
    }
    /**
     * @fn String Esp8266::wifiBegin( StringList *args )
     *
     * Connect to wireless network.
     *
     * @param[in] args Reference to arguments.
     * @return Wireless ip address, Otherwise error string.
     */
    String Esp8266::wifiBegin( StringList *args )
    {
        String s;
        unsigned long i = 0;

        switch( count(args) )
        {
            case 2:
            // Start
                WiFi.disconnect();
                WiFi.mode( WIFI_STA );
                WiFi.begin( _a(0).c_str(), _a(1).c_str() );
            // Waiting
                i = ::millis();
                while( WiFi.status()!=WL_CONNECTED && (::millis()-i)<ESP_WIFI_TIMEOUT )
                    ::delay( 500 );
            // Result
                if( WiFi.status()!=WL_CONNECTED )
                    s = STR_CANT_CONNECT_TO_WIRELESS_NETWORK;
                else
                {
                    StringList sl;
                    s = ifConfig( &sl );
                }
                break;
            default:
                s = usage( "wifiBegin ssid password" );
                break;
        }

        return s;
    }
    /**
     * @fn String Esp8266::wifiEnd( StringList *args )
     *
     * Detach from wireless network.
     *
     * @param[in] args Reference to arguments.
     * @return Empty string.
     */
    String Esp8266::wifiEnd( StringList *args )
    {
        String s;

        switch( count(args) )
        {
            case 0:
                if( WiFi.status()!=WL_CONNECTED )
                    s = wifiEnd( 0 );
                else
                    WiFi.disconnect();
                break;
            default:
                s = usage( "wifiEnd" );
                break;
        }

        return s;
    }
    /**
     * @fn String Esp8266::wifiRtc( StringList *args )
     *
     * Get rtc from the WiFi network.
     *
     * @param[in] args Reference to arguments.
     * @return unixtime string.
     */
    String Esp8266::wifiRtc( StringList *args )
    {
        String s;
        time_t now;

        switch( count(args) )
        {
            case 0:
                if( WiFi.status()!=WL_CONNECTED )
                    s = wifiRtc( 0 );
                else
                {
                    configTzTime( "JST-9", "ntp.nict.jp", "time.google.com", "ntp.jst.mfeed.ad.jp" );
                    time( &now );
                    s = String( now );
                    s = prettyPrintTo( "value", s );
                }
                break;
            default:
                s = usage( "wifiRtc" );
                break;
        }

        return s;
    }
    /**
     * @fn String Esp8266::appendRootPath( const String &path )
     *
     * Append root path ("/") if need.
     *
     * @return Path include root.
     */
    String Esp8266::appendRootPath( const String &path )
    {
        String s = path;
        String r = "/";

        if( s.indexOf(r) )
            s = r + s;

        return s;
    }
    /**
     * @fn void Esp8266::reboot( void )
     *
     * Reboot the system.
     */
    void Esp8266::reboot( void )
    {
        ESP.restart();
    }
    /**
     * @fn String Esp8266::requestBodyHeaderInPut( const String &value )
     *
     * Return request body header in HTTP PUT.
     *
     * @param[in] boundary Boundary string.
     * @param[in] name Content-Disposition: name attribute string.
     * @param[in] value Putted value.
     * @param[in/out] size Putted value size. If value is file, File size is used.
     * @return Request body header string in HTTP PUT.
     */
    String Esp8266::requestBodyHeaderInPut( const String &boundary, const String &name, const String &value, int *size )
    {
        String s;
        String t = appendRootPath( value );

    // If file is exitst, use file size
        if( !EspStorage->exists(t) )
            s = AoiUtil::Http::requestBodyHeaderInPut( boundary, name, value, size );
        else
        {
            s += "--" + boundary + "\r\n";
            s += "Content-Disposition: form-data; name=\"" + name + "\";";
            s += " filename=\"" + value + "\"\r\n";
            s += "Content-Type: application/octet-stream\r\n";
            s += "Content-Transfer-Encoding: binary\r\n";
            File f = EspStorage->open( t, _FILE_READ_ );
            *size = f.size();
            f.close();
            s += "\r\n";
        }

        return s;
    }
}
#endif
